{
  "sheet": "FAQ",
  "data": {
    "If this won’t happen until 2030, why do I need to worry now? ": "America is already facing an affordable housing crisis. Since 1985, the share of apartment households paying at least 30 percent of their income for housing costs (rent and utilities) has increased from 42 percent to now more than half (55 percent). More than one in four (29 percent) spend at least half their income on housing costs, a sign that their housing costs are a significant financial burden. If we don’t act now, affordability will only become a larger problem.",
    "Most Americans don’t live in apartments, is this really a big deal?": "39 million Americans call an apartment home. Today, demand for apartments is at unprecedented levels as the number of renters has reached an all-time high. Annual growth in renter households has exceeded 800,000 on average since 2010 - and almost as much as 1.2 million by some measures.. This trend is expected to not only continue, but rapidly increase over the next decade.",
    "Why is apartment demand growing? ": "Three major demographic shifts are having the strongest impact on demand for rental housing: The rise of young adults as the largest demographic group in the U.S., the aging of the baby boomers, and immigration’s increasing contribution to population growth. ",
    "What can be done to build more? ": "Meeting demand will require both revamping how we build apartments and the courage for policymakers at the federal, state and local levels to implement inventive policy ideas, provide incentives and reduce impediments to building apartments to meet the demand across all income levels.  ",
    "What was your methodology? ": "Our experts took a nationally-based model, using public and private data sources, to forecast a conservative estimate of key drivers of apartment demand, including population growth, household formation, and the homeownership rate. From that estimate, they developed a methodology for all 50 states and the District of Columbia, as well as 50 metropolitan areas (as defined by the U.S. Census Bureau).",
    "What’s stopping more apartments from being built?": "It’s not easy to build apartments. It can take up to a decade to just break ground. Regulatory barriers to apartment construction have also increased significantly. Obstacles to development include outdated zoning laws, unnecessary land use restrictions, arbitrary permitting requirements, inflated parking requirements, environmental site assessments, discouraging housing construction and raising costs."
  },
  "labels": [
    "Answer"
  ]
}